music_app/app/controllers/albums_controller.rb

SELECT "bands".* FROM "bands" WHERE "bands"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
    def create
        @band = Band.find_by(id: params[:band_id])

SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def new
        @band = Band.find_by(id: params[:band_id])