music_app/app/controllers/bands_controller.rb

    def set_band
        @band = Band.find_by(id: params[:id])
---
SELECT "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @band.update(band_params)
        if @band.save
---
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "KoR"], ["updated_at", "2023-06-13 20:59:25.042066"], ["id", 1]]
UPDATE "bands" SET "name" = $1, "updated_at" = $2 WHERE "bands"."id" = $3  [["name", "Shania Twai"], ["updated_at", "2023-06-13 20:37:13.090248"], ["id", 2]]

    def destroy
        @band.delete
---
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]